<?xml version="1.0"?>
<GCC_XML cvs_revision="1.127">

  <Struct id="_485" name="FMOD_REVERB_PROPERTIES" context="_1" mangled="22FMOD_REVERB_PROPERTIES" demangled="FMOD_REVERB_PROPERTIES" location="f0:1517" file="f0" line="1517" artificial="1" size="992" align="32" members="_861 _862 _863 _864 _865 _866 _867 _868 _869 _870 _871 _872 _873 _874 _875 _876 _877 _878 _879 _880 _881 _882 _883 _884 _885 _886 _887 _888 _889 _890 _891 " bases=""/>
  <Typedef id="_486" name="FMOD_REVERB_PROPERTIES" type="_485" context="_1" location="f0:1545" file="f0" line="1545"/>
  <Function id="_487" name="FMOD_Sound_GetLoopCount" returns="_412" context="_1" location="f0:2103" file="f0" line="2103" extern="1">
    <Argument name="sound" type="_508" location="f0:2103" file="f0" line="2103"/>
    <Argument name="loopcount" type="_516" location="f0:2103" file="f0" line="2103"/>
  </Function>
  <Function id="_488" name="FMOD_ChannelGroup_GetUserData" returns="_412" context="_1" location="f0:2291" file="f0" line="2291" extern="1">
    <Argument name="channelgroup" type="_515" location="f0:2291" file="f0" line="2291"/>
    <Argument name="userdata" type="_535" location="f0:2291" file="f0" line="2291"/>
  </Function>
  <Function id="_489" name="FMOD_ChannelGroup_AddDSP" returns="_412" context="_1" location="f0:2274" file="f0" line="2274" extern="1">
    <Argument name="channelgroup" type="_515" location="f0:2274" file="f0" line="2274"/>
    <Argument name="dsp" type="_501" location="f0:2274" file="f0" line="2274"/>
    <Argument name="connection" type="_566" location="f0:2274" file="f0" line="2274"/>
  </Function>
  <Struct id="_490" name="FMOD_CHANNELGROUP" context="_1" incomplete="1" mangled="17FMOD_CHANNELGROUP" demangled="FMOD_CHANNELGROUP" location="f0:66" file="f0" line="66" artificial="1" align="8"/>
  <Typedef id="_491" name="FMOD_CHANNELGROUP" type="_490" context="_1" location="f0:66" file="f0" line="66"/>
  <Function id="_492" name="FMOD_Channel_GetSpeakerMix" returns="_412" context="_1" location="f0:2144" file="f0" line="2144" extern="1">
    <Argument name="channel" type="_506" location="f0:2144" file="f0" line="2144"/>
    <Argument name="frontleft" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="frontright" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="center" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="lfe" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="backleft" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="backright" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="sideleft" type="_507" location="f0:2144" file="f0" line="2144"/>
    <Argument name="sideright" type="_507" location="f0:2144" file="f0" line="2144"/>
  </Function>
  <Function id="_493" name="FMOD_System_SetSoftwareFormat" returns="_412" context="_1" location="f0:1900" file="f0" line="1900" extern="1">
    <Argument name="system" type="_503" location="f0:1900" file="f0" line="1900"/>
    <Argument name="samplerate" type="_359" location="f0:1900" file="f0" line="1900"/>
    <Argument name="format" type="_107" location="f0:1900" file="f0" line="1900"/>
    <Argument name="numoutputchannels" type="_359" location="f0:1900" file="f0" line="1900"/>
    <Argument name="maxinputchannels" type="_359" location="f0:1900" file="f0" line="1900"/>
    <Argument name="resamplemethod" type="_116" location="f0:1900" file="f0" line="1900"/>
  </Function>
  <Typedef id="_494" name="FMOD_CODEC_GETPOSITIONCALLBACK" type="_472" context="_1" location="f2:24" file="f2" line="24"/>
  <Function id="_495" name="FMOD_DSPConnection_SetUserData" returns="_412" context="_1" location="f0:2409" file="f0" line="2409" extern="1">
    <Argument name="dspconnection" type="_531" location="f0:2409" file="f0" line="2409"/>
    <Argument name="userdata" type="_559" location="f0:2409" file="f0" line="2409"/>
  </Function>
  <Function id="_496" name="FMOD_DSPConnection_GetInput" returns="_412" context="_1" location="f0:2398" file="f0" line="2398" extern="1">
    <Argument name="dspconnection" type="_531" location="f0:2398" file="f0" line="2398"/>
    <Argument name="input" type="_520" location="f0:2398" file="f0" line="2398"/>
  </Function>
  <Function id="_497" name="FMOD_DSPConnection_SetLevels" returns="_412" context="_1" location="f0:2402" file="f0" line="2402" extern="1">
    <Argument name="dspconnection" type="_531" location="f0:2402" file="f0" line="2402"/>
    <Argument name="speaker" type="_122" location="f0:2402" file="f0" line="2402"/>
    <Argument name="levels" type="_507" location="f0:2402" file="f0" line="2402"/>
    <Argument name="numlevels" type="_359" location="f0:2402" file="f0" line="2402"/>
  </Function>
  <PointerType id="_498" type="_892" size="32" align="32"/>
  <Typedef id="_499" name="FMOD_CODEC_READCALLBACK" type="_498" context="_1" location="f2:21" file="f2" line="21"/>
  <Function id="_500" name="FMOD_Geometry_GetPosition" returns="_412" context="_1" location="f0:2442" file="f0" line="2442" extern="1">
    <Argument name="geometry" type="_512" location="f0:2442" file="f0" line="2442"/>
    <Argument name="position" type="_518" location="f0:2442" file="f0" line="2442"/>
  </Function>
  <PointerType id="_501" type="_215" size="32" align="32"/>
  <PointerType id="_502" type="_503" size="32" align="32"/>
  <PointerType id="_503" type="_383" size="32" align="32"/>
  <PointerType id="_504" type="_55" size="32" align="32"/>
  <PointerType id="_506" type="_220" size="32" align="32"/>
  <PointerType id="_507" type="_558" size="32" align="32"/>
  <PointerType id="_508" type="_442" size="32" align="32"/>
  <PointerType id="_509" type="_893" size="32" align="32"/>
  <PointerType id="_511" type="_208" size="32" align="32"/>
  <PointerType id="_512" type="_30" size="32" align="32"/>
  <PointerType id="_513" type="_96c" size="32" align="32"/>
  <PointerType id="_514" type="_360" size="32" align="32"/>
  <PointerType id="_515" type="_491" size="32" align="32"/>
  <PointerType id="_516" type="_359" size="32" align="32"/>
  <PointerType id="_518" type="_96" size="32" align="32"/>
  <PointerType id="_519" type="_48" size="32" align="32"/>
  <PointerType id="_520" type="_501" size="32" align="32"/>
  <PointerType id="_522" type="_486" size="32" align="32"/>
  <Field id="_523" name="Data1" type="_78" offset="0" context="_38" access="public" location="f0:260" file="f0" line="260"/>
  <Field id="_524" name="Data2" type="_895" offset="32" context="_38" access="public" location="f0:261" file="f0" line="261"/>
  <Field id="_525" name="Data3" type="_895" offset="48" context="_38" access="public" location="f0:262" file="f0" line="262"/>
  <Field id="_526" name="Data4" type="_896" offset="64" context="_38" access="public" location="f0:263" file="f0" line="263"/>
  <Destructor id="_527" name="$_2" artificial="1" throw="" context="_38" access="public" mangled="_ZN9FMOD_GUIDD1Ev *INTERNAL* " demangled="FMOD_GUID::~FMOD_GUID()" location="f0:264" file="f0" line="264" endline="264" inline="1">
  </Destructor>
  <OperatorMethod id="_528" name="=" returns="_897" artificial="1" throw="" context="_38" access="public" mangled="_ZN9FMOD_GUIDaSERKS_" demangled="FMOD_GUID::operator=(FMOD_GUID const&amp;)" location="f0:264" file="f0" line="264" endline="264" inline="1">
    <Argument type="_898" location="f0:259" file="f0" line="259"/>
  </OperatorMethod>
  <Constructor id="_529" name="$_2" artificial="1" throw="" context="_38" access="public" mangled="_ZN9FMOD_GUIDC1ERKS_ *INTERNAL* " demangled="FMOD_GUID::FMOD_GUID(FMOD_GUID const&amp;)" location="f0:264" file="f0" line="264" endline="264" inline="1">
    <Argument type="_898" location="f0:259" file="f0" line="259"/>
  </Constructor>
  <Constructor id="_530" name="$_2" artificial="1" throw="" context="_38" access="public" mangled="_ZN9FMOD_GUIDC1Ev *INTERNAL* " demangled="FMOD_GUID::FMOD_GUID()" location="f0:264" file="f0" line="264" inline="1"/>
  <PointerType id="_531" type="_300" size="32" align="32"/>
  <PointerType id="_532" type="_25" size="32" align="32"/>
  <PointerType id="_533" type="_78" size="32" align="32"/>
  <PointerType id="_535" type="_559" size="32" align="32"/>
  <Field id="_536" name="name" type="_899" offset="0" context="_47" access="public" location="f1:135" file="f1" line="135"/>
  <Field id="_537" name="version" type="_78" offset="256" context="_47" access="public" location="f1:136" file="f1" line="136"/>
  <Field id="_538" name="channels" type="_359" offset="288" context="_47" access="public" location="f1:137" file="f1" line="137"/>
  <Field id="_539" name="create" type="_390" offset="320" context="_47" access="public" location="f1:138" file="f1" line="138"/>
  <Field id="_540" name="release" type="_7" offset="352" context="_47" access="public" location="f1:139" file="f1" line="139"/>
  <Field id="_541" name="reset" type="_349" offset="384" context="_47" access="public" location="f1:140" file="f1" line="140"/>
  <Field id="_542" name="read" type="_160" offset="416" context="_47" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_543" name="setposition" type="_456" offset="448" context="_47" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_544" name="numparameters" type="_359" offset="480" context="_47" access="public" location="f1:144" file="f1" line="144"/>
  <Field id="_545" name="paramdesc" type="_900" offset="512" context="_47" access="public" location="f1:145" file="f1" line="145"/>
  <Field id="_546" name="setparameter" type="_36" offset="544" context="_47" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_547" name="getparameter" type="_297" offset="576" context="_47" access="public" location="f1:147" file="f1" line="147"/>
  <Field id="_548" name="config" type="_151" offset="608" context="_47" access="public" location="f1:148" file="f1" line="148"/>
  <Field id="_549" name="configwidth" type="_359" offset="640" context="_47" access="public" location="f1:149" file="f1" line="149"/>
  <Field id="_550" name="configheight" type="_359" offset="672" context="_47" access="public" location="f1:150" file="f1" line="150"/>
  <Field id="_551" name="userdata" type="_559" offset="704" context="_47" access="public" location="f1:151" file="f1" line="151"/>
  <Destructor id="_552" name="FMOD_DSP_DESCRIPTION" artificial="1" throw="" context="_47" access="public" mangled="_ZN20FMOD_DSP_DESCRIPTIOND1Ev *INTERNAL* " demangled="FMOD_DSP_DESCRIPTION::~FMOD_DSP_DESCRIPTION()" location="f1:134" file="f1" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_553" name="=" returns="_901" artificial="1" throw="" context="_47" access="public" mangled="_ZN20FMOD_DSP_DESCRIPTIONaSERKS_" demangled="FMOD_DSP_DESCRIPTION::operator=(FMOD_DSP_DESCRIPTION const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_902" location="f1:134" file="f1" line="134"/>
  </OperatorMethod>
  <Constructor id="_554" name="FMOD_DSP_DESCRIPTION" artificial="1" throw="" context="_47" access="public" mangled="_ZN20FMOD_DSP_DESCRIPTIONC1ERKS_ *INTERNAL* " demangled="FMOD_DSP_DESCRIPTION::FMOD_DSP_DESCRIPTION(FMOD_DSP_DESCRIPTION const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_902" location="f1:134" file="f1" line="134"/>
  </Constructor>
  <Constructor id="_555" name="FMOD_DSP_DESCRIPTION" artificial="1" throw="" context="_47" access="public" mangled="_ZN20FMOD_DSP_DESCRIPTIONC1Ev *INTERNAL* " demangled="FMOD_DSP_DESCRIPTION::FMOD_DSP_DESCRIPTION()" location="f1:134" file="f1" line="134" inline="1"/>
  <PointerType id="_556" type="_903" size="32" align="32"/>
  <PointerType id="_557" type="_38" size="32" align="32"/>
  <FundamentalType id="_558" name="float" size="32" align="32"/>
  <PointerType id="_559" type="_904" size="32" align="32"/>
  <PointerType id="_560" type="_286" size="32" align="32"/>
  <PointerType id="_561" type="_475" size="32" align="32"/>
  <PointerType id="_564" type="_508" size="32" align="32"/>
  <PointerType id="_565" type="_512" size="32" align="32"/>
  <PointerType id="_566" type="_531" size="32" align="32"/>
  <PointerType id="_567" type="_40" size="32" align="32"/>
  <Field id="_568" name="x" type="_558" offset="0" context="_96" access="public" location="f0:238" file="f0" line="238"/>
  <Field id="_569" name="y" type="_558" offset="32" context="_96" access="public" location="f0:239" file="f0" line="239"/>
  <Field id="_570" name="z" type="_558" offset="64" context="_96" access="public" location="f0:240" file="f0" line="240"/>
  <Destructor id="_571" name="$_1" artificial="1" throw="" context="_96" access="public" mangled="_ZN11FMOD_VECTORD1Ev *INTERNAL* " demangled="FMOD_VECTOR::~FMOD_VECTOR()" location="f0:241" file="f0" line="241" endline="241" inline="1">
  </Destructor>
  <OperatorMethod id="_572" name="=" returns="_905" artificial="1" throw="" context="_96" access="public" mangled="_ZN11FMOD_VECTORaSERKS_" demangled="FMOD_VECTOR::operator=(FMOD_VECTOR const&amp;)" location="f0:241" file="f0" line="241" endline="241" inline="1">
    <Argument type="_906" location="f0:237" file="f0" line="237"/>
  </OperatorMethod>
  <Constructor id="_573" name="$_1" artificial="1" throw="" context="_96" access="public" mangled="_ZN11FMOD_VECTORC1ERKS_ *INTERNAL* " demangled="FMOD_VECTOR::FMOD_VECTOR(FMOD_VECTOR const&amp;)" location="f0:241" file="f0" line="241" endline="241" inline="1">
    <Argument type="_906" location="f0:237" file="f0" line="237"/>
  </Constructor>
  <Constructor id="_574" name="$_1" artificial="1" throw="" context="_96" access="public" mangled="_ZN11FMOD_VECTORC1Ev *INTERNAL* " demangled="FMOD_VECTOR::FMOD_VECTOR()" location="f0:241" file="f0" line="241" inline="1"/>
  <PointerType id="_575" type="_515" size="32" align="32"/>
  <PointerType id="_576" type="_280" size="32" align="32"/>
  <PointerType id="_577" type="_32" size="32" align="32"/>
  <Field id="_581" name="name" type="_907" offset="0" context="_131" access="public" location="f2:97" file="f2" line="97"/>
  <Field id="_582" name="format" type="_107" offset="2048" context="_131" access="public" location="f2:98" file="f2" line="98"/>
  <Field id="_583" name="channels" type="_359" offset="2080" context="_131" access="public" location="f2:99" file="f2" line="99"/>
  <Field id="_584" name="frequency" type="_359" offset="2112" context="_131" access="public" location="f2:100" file="f2" line="100"/>
  <Field id="_585" name="lengthbytes" type="_78" offset="2144" context="_131" access="public" location="f2:101" file="f2" line="101"/>
  <Field id="_586" name="lengthpcm" type="_78" offset="2176" context="_131" access="public" location="f2:102" file="f2" line="102"/>
  <Field id="_587" name="blockalign" type="_359" offset="2208" context="_131" access="public" location="f2:103" file="f2" line="103"/>
  <Field id="_588" name="loopstart" type="_359" offset="2240" context="_131" access="public" location="f2:104" file="f2" line="104"/>
  <Field id="_589" name="loopend" type="_359" offset="2272" context="_131" access="public" location="f2:105" file="f2" line="105"/>
  <Field id="_590" name="mode" type="_303" offset="2304" context="_131" access="public" location="f2:106" file="f2" line="106"/>
  <Field id="_591" name="channelmask" type="_78" offset="2336" context="_131" access="public" location="f2:107" file="f2" line="107"/>
  <Destructor id="_592" name="FMOD_CODEC_WAVEFORMAT" artificial="1" throw="" context="_131" access="public" mangled="_ZN21FMOD_CODEC_WAVEFORMATD1Ev *INTERNAL* " demangled="FMOD_CODEC_WAVEFORMAT::~FMOD_CODEC_WAVEFORMAT()" location="f2:96" file="f2" line="96" endline="96" inline="1">
  </Destructor>
  <OperatorMethod id="_593" name="=" returns="_908" artificial="1" throw="" context="_131" access="public" mangled="_ZN21FMOD_CODEC_WAVEFORMATaSERKS_" demangled="FMOD_CODEC_WAVEFORMAT::operator=(FMOD_CODEC_WAVEFORMAT const&amp;)" location="f2:96" file="f2" line="96" endline="96" inline="1">
    <Argument type="_909" location="f2:96" file="f2" line="96"/>
  </OperatorMethod>
  <Constructor id="_594" name="FMOD_CODEC_WAVEFORMAT" artificial="1" throw="" context="_131" access="public" mangled="_ZN21FMOD_CODEC_WAVEFORMATC1ERKS_ *INTERNAL* " demangled="FMOD_CODEC_WAVEFORMAT::FMOD_CODEC_WAVEFORMAT(FMOD_CODEC_WAVEFORMAT const&amp;)" location="f2:96" file="f2" line="96" endline="96" inline="1">
    <Argument type="_909" location="f2:96" file="f2" line="96"/>
  </Constructor>
  <Constructor id="_595" name="FMOD_CODEC_WAVEFORMAT" artificial="1" throw="" context="_131" access="public" mangled="_ZN21FMOD_CODEC_WAVEFORMATC1Ev *INTERNAL* " demangled="FMOD_CODEC_WAVEFORMAT::FMOD_CODEC_WAVEFORMAT()" location="f2:96" file="f2" line="96" inline="1"/>
  <PointerType id="_596" type="_170c" size="32" align="32"/>
  <Field id="_597" name="min" type="_558" offset="0" context="_148" access="public" location="f1:102" file="f1" line="102"/>
  <Field id="_598" name="max" type="_558" offset="32" context="_148" access="public" location="f1:103" file="f1" line="103"/>
  <Field id="_599" name="defaultval" type="_558" offset="64" context="_148" access="public" location="f1:104" file="f1" line="104"/>
  <Field id="_600" name="name" type="_911" offset="96" context="_148" access="public" location="f1:105" file="f1" line="105"/>
  <Field id="_601" name="label" type="_911" offset="224" context="_148" access="public" location="f1:106" file="f1" line="106"/>
  <Field id="_602" name="description" type="_684" offset="352" context="_148" access="public" location="f1:107" file="f1" line="107"/>
  <Destructor id="_603" name="FMOD_DSP_PARAMETERDESC" artificial="1" throw="" context="_148" access="public" mangled="_ZN22FMOD_DSP_PARAMETERDESCD1Ev *INTERNAL* " demangled="FMOD_DSP_PARAMETERDESC::~FMOD_DSP_PARAMETERDESC()" location="f1:101" file="f1" line="101" endline="101" inline="1">
  </Destructor>
  <OperatorMethod id="_604" name="=" returns="_912" artificial="1" throw="" context="_148" access="public" mangled="_ZN22FMOD_DSP_PARAMETERDESCaSERKS_" demangled="FMOD_DSP_PARAMETERDESC::operator=(FMOD_DSP_PARAMETERDESC const&amp;)" location="f1:101" file="f1" line="101" endline="101" inline="1">
    <Argument type="_913" location="f1:101" file="f1" line="101"/>
  </OperatorMethod>
  <Constructor id="_605" name="FMOD_DSP_PARAMETERDESC" artificial="1" throw="" context="_148" access="public" mangled="_ZN22FMOD_DSP_PARAMETERDESCC1ERKS_ *INTERNAL* " demangled="FMOD_DSP_PARAMETERDESC::FMOD_DSP_PARAMETERDESC(FMOD_DSP_PARAMETERDESC const&amp;)" location="f1:101" file="f1" line="101" endline="101" inline="1">
    <Argument type="_913" location="f1:101" file="f1" line="101"/>
  </Constructor>
  <Constructor id="_606" name="FMOD_DSP_PARAMETERDESC" artificial="1" throw="" context="_148" access="public" mangled="_ZN22FMOD_DSP_PARAMETERDESCC1Ev *INTERNAL* " demangled="FMOD_DSP_PARAMETERDESC::FMOD_DSP_PARAMETERDESC()" location="f1:101" file="f1" line="101" inline="1"/>
  <Field id="_608" name="handle" type="_559" offset="0" context="_154" access="public" location="f0:295" file="f0" line="295"/>
  <Field id="_609" name="offset" type="_78" offset="32" context="_154" access="public" location="f0:296" file="f0" line="296"/>
  <Field id="_610" name="sizebytes" type="_78" offset="64" context="_154" access="public" location="f0:297" file="f0" line="297"/>
  <Field id="_611" name="priority" type="_359" offset="96" context="_154" access="public" location="f0:298" file="f0" line="298"/>
  <Field id="_612" name="buffer" type="_559" offset="128" context="_154" access="public" location="f0:300" file="f0" line="300"/>
  <Field id="_613" name="bytesread" type="_78" offset="160" context="_154" access="public" location="f0:301" file="f0" line="301"/>
  <Field id="_614" name="result" type="_412" offset="192" context="_154" access="public" location="f0:302" file="f0" line="302"/>
  <Field id="_615" name="userdata" type="_559" offset="224" context="_154" access="public" location="f0:304" file="f0" line="304"/>
  <Destructor id="_616" name="$_3" artificial="1" throw="" context="_154" access="public" mangled="_ZN18FMOD_ASYNCREADINFOD1Ev *INTERNAL* " demangled="FMOD_ASYNCREADINFO::~FMOD_ASYNCREADINFO()" location="f0:305" file="f0" line="305" endline="305" inline="1">
  </Destructor>
  <OperatorMethod id="_617" name="=" returns="_914" artificial="1" throw="" context="_154" access="public" mangled="_ZN18FMOD_ASYNCREADINFOaSERKS_" demangled="FMOD_ASYNCREADINFO::operator=(FMOD_ASYNCREADINFO const&amp;)" location="f0:305" file="f0" line="305" endline="305" inline="1">
    <Argument type="_915" location="f0:294" file="f0" line="294"/>
  </OperatorMethod>
  <Constructor id="_618" name="$_3" artificial="1" throw="" context="_154" access="public" mangled="_ZN18FMOD_ASYNCREADINFOC1ERKS_ *INTERNAL* " demangled="FMOD_ASYNCREADINFO::FMOD_ASYNCREADINFO(FMOD_ASYNCREADINFO const&amp;)" location="f0:305" file="f0" line="305" endline="305" inline="1">
    <Argument type="_915" location="f0:294" file="f0" line="294"/>
  </Constructor>
  <Constructor id="_619" name="$_3" artificial="1" throw="" context="_154" access="public" mangled="_ZN18FMOD_ASYNCREADINFOC1Ev *INTERNAL* " demangled="FMOD_ASYNCREADINFO::FMOD_ASYNCREADINFO()" location="f0:305" file="f0" line="305" inline="1"/>
  <Field id="_621" name="Direct" type="_359" offset="0" context="_169" access="public" location="f0:1708" file="f0" line="1708"/>
  <Field id="_622" name="DirectHF" type="_359" offset="32" context="_169" access="public" location="f0:1709" file="f0" line="1709"/>
  <Field id="_623" name="Room" type="_359" offset="64" context="_169" access="public" location="f0:1710" file="f0" line="1710"/>
  <Field id="_624" name="RoomHF" type="_359" offset="96" context="_169" access="public" location="f0:1711" file="f0" line="1711"/>
  <Field id="_625" name="Obstruction" type="_359" offset="128" context="_169" access="public" location="f0:1712" file="f0" line="1712"/>
  <Field id="_626" name="ObstructionLFRatio" type="_558" offset="160" context="_169" access="public" location="f0:1713" file="f0" line="1713"/>
  <Field id="_627" name="Occlusion" type="_359" offset="192" context="_169" access="public" location="f0:1714" file="f0" line="1714"/>
  <Field id="_628" name="OcclusionLFRatio" type="_558" offset="224" context="_169" access="public" location="f0:1715" file="f0" line="1715"/>
  <Field id="_629" name="OcclusionRoomRatio" type="_558" offset="256" context="_169" access="public" location="f0:1716" file="f0" line="1716"/>
  <Field id="_630" name="OcclusionDirectRatio" type="_558" offset="288" context="_169" access="public" location="f0:1717" file="f0" line="1717"/>
  <Field id="_631" name="Exclusion" type="_359" offset="320" context="_169" access="public" location="f0:1718" file="f0" line="1718"/>
  <Field id="_632" name="ExclusionLFRatio" type="_558" offset="352" context="_169" access="public" location="f0:1719" file="f0" line="1719"/>
  <Field id="_633" name="OutsideVolumeHF" type="_359" offset="384" context="_169" access="public" location="f0:1720" file="f0" line="1720"/>
  <Field id="_634" name="DopplerFactor" type="_558" offset="416" context="_169" access="public" location="f0:1721" file="f0" line="1721"/>
  <Field id="_635" name="RolloffFactor" type="_558" offset="448" context="_169" access="public" location="f0:1722" file="f0" line="1722"/>
  <Field id="_636" name="RoomRolloffFactor" type="_558" offset="480" context="_169" access="public" location="f0:1723" file="f0" line="1723"/>
  <Field id="_637" name="AirAbsorptionFactor" type="_558" offset="512" context="_169" access="public" location="f0:1724" file="f0" line="1724"/>
  <Field id="_638" name="Flags" type="_78" offset="544" context="_169" access="public" location="f0:1725" file="f0" line="1725"/>
  <Field id="_639" name="ConnectionPoint" type="_501" offset="576" context="_169" access="public" location="f0:1726" file="f0" line="1726"/>
  <Destructor id="_640" name="FMOD_REVERB_CHANNELPROPERTIES" artificial="1" throw="" context="_169" access="public" mangled="_ZN29FMOD_REVERB_CHANNELPROPERTIESD1Ev *INTERNAL* " demangled="FMOD_REVERB_CHANNELPROPERTIES::~FMOD_REVERB_CHANNELPROPERTIES()" location="f0:1707" file="f0" line="1707" endline="1707" inline="1">
  </Destructor>
  <OperatorMethod id="_641" name="=" returns="_916" artificial="1" throw="" context="_169" access="public" mangled="_ZN29FMOD_REVERB_CHANNELPROPERTIESaSERKS_" demangled="FMOD_REVERB_CHANNELPROPERTIES::operator=(FMOD_REVERB_CHANNELPROPERTIES const&amp;)" location="f0:1707" file="f0" line="1707" endline="1707" inline="1">
    <Argument type="_917" location="f0:1707" file="f0" line="1707"/>
  </OperatorMethod>
  <Constructor id="_642" name="FMOD_REVERB_CHANNELPROPERTIES" artificial="1" throw="" context="_169" access="public" mangled="_ZN29FMOD_REVERB_CHANNELPROPERTIESC1ERKS_ *INTERNAL* " demangled="FMOD_REVERB_CHANNELPROPERTIES::FMOD_REVERB_CHANNELPROPERTIES(FMOD_REVERB_CHANNELPROPERTIES const&amp;)" location="f0:1707" file="f0" line="1707" endline="1707" inline="1">
    <Argument type="_917" location="f0:1707" file="f0" line="1707"/>
  </Constructor>
  <Constructor id="_643" name="FMOD_REVERB_CHANNELPROPERTIES" artificial="1" throw="" context="_169" access="public" mangled="_ZN29FMOD_REVERB_CHANNELPROPERTIESC1Ev *INTERNAL* " demangled="FMOD_REVERB_CHANNELPROPERTIES::FMOD_REVERB_CHANNELPROPERTIES()" location="f0:1707" file="f0" line="1707" inline="1"/>
  <PointerType id="_644" type="_486c" size="32" align="32"/>
  <Field id="_647" name="instance" type="_501" offset="0" context="_204" access="public" location="f1:174" file="f1" line="174"/>
  <Field id="_648" name="plugindata" type="_559" offset="32" context="_204" access="public" location="f1:175" file="f1" line="175"/>
  <Field id="_649" name="speakermask" type="_895" offset="64" context="_204" access="public" location="f1:176" file="f1" line="176"/>
  <Destructor id="_650" name="FMOD_DSP_STATE" artificial="1" throw="" context="_204" access="public" mangled="_ZN14FMOD_DSP_STATED1Ev *INTERNAL* " demangled="FMOD_DSP_STATE::~FMOD_DSP_STATE()" location="f1:173" file="f1" line="173" endline="173" inline="1">
  </Destructor>
  <OperatorMethod id="_651" name="=" returns="_919" artificial="1" throw="" context="_204" access="public" mangled="_ZN14FMOD_DSP_STATEaSERKS_" demangled="FMOD_DSP_STATE::operator=(FMOD_DSP_STATE const&amp;)" location="f1:173" file="f1" line="173" endline="173" inline="1">
    <Argument type="_920" location="f1:173" file="f1" line="173"/>
  </OperatorMethod>
  <Constructor id="_652" name="FMOD_DSP_STATE" artificial="1" throw="" context="_204" access="public" mangled="_ZN14FMOD_DSP_STATEC1ERKS_ *INTERNAL* " demangled="FMOD_DSP_STATE::FMOD_DSP_STATE(FMOD_DSP_STATE const&amp;)" location="f1:173" file="f1" line="173" endline="173" inline="1">
    <Argument type="_920" location="f1:173" file="f1" line="173"/>
  </Constructor>
  <Constructor id="_653" name="FMOD_DSP_STATE" artificial="1" throw="" context="_204" access="public" mangled="_ZN14FMOD_DSP_STATEC1Ev *INTERNAL* " demangled="FMOD_DSP_STATE::FMOD_DSP_STATE()" location="f1:173" file="f1" line="173" inline="1"/>
  <Field id="_654" name="cbsize" type="_359" offset="0" context="_207" access="public" location="f0:1801" file="f0" line="1801"/>
  <Field id="_655" name="maxMPEGcodecs" type="_359" offset="32" context="_207" access="public" location="f0:1802" file="f0" line="1802"/>
  <Field id="_656" name="maxADPCMcodecs" type="_359" offset="64" context="_207" access="public" location="f0:1803" file="f0" line="1803"/>
  <Field id="_657" name="maxXMAcodecs" type="_359" offset="96" context="_207" access="public" location="f0:1804" file="f0" line="1804"/>
  <Field id="_658" name="maxCELTcodecs" type="_359" offset="128" context="_207" access="public" location="f0:1805" file="f0" line="1805"/>
  <Field id="_659" name="maxPCMcodecs" type="_359" offset="160" context="_207" access="public" location="f0:1806" file="f0" line="1806"/>
  <Field id="_660" name="ASIONumChannels" type="_359" offset="192" context="_207" access="public" location="f0:1807" file="f0" line="1807"/>
  <Field id="_661" name="ASIOChannelList" type="_921" offset="224" context="_207" access="public" location="f0:1808" file="f0" line="1808"/>
  <Field id="_662" name="ASIOSpeakerList" type="_922" offset="256" context="_207" access="public" location="f0:1809" file="f0" line="1809"/>
  <Field id="_663" name="max3DReverbDSPs" type="_359" offset="288" context="_207" access="public" location="f0:1810" file="f0" line="1810"/>
  <Field id="_664" name="HRTFMinAngle" type="_558" offset="320" context="_207" access="public" location="f0:1811" file="f0" line="1811"/>
  <Field id="_665" name="HRTFMaxAngle" type="_558" offset="352" context="_207" access="public" location="f0:1812" file="f0" line="1812"/>
  <Field id="_666" name="HRTFFreq" type="_558" offset="384" context="_207" access="public" location="f0:1813" file="f0" line="1813"/>
  <Field id="_667" name="vol0virtualvol" type="_558" offset="416" context="_207" access="public" location="f0:1814" file="f0" line="1814"/>
  <Field id="_668" name="eventqueuesize" type="_359" offset="448" context="_207" access="public" location="f0:1815" file="f0" line="1815"/>
  <Field id="_669" name="defaultDecodeBufferSize" type="_78" offset="480" context="_207" access="public" location="f0:1816" file="f0" line="1816"/>
  <Field id="_670" name="debugLogFilename" type="_509" offset="512" context="_207" access="public" location="f0:1817" file="f0" line="1817"/>
  <Field id="_671" name="profileport" type="_895" offset="544" context="_207" access="public" location="f0:1818" file="f0" line="1818"/>
  <Field id="_672" name="geometryMaxFadeTime" type="_78" offset="576" context="_207" access="public" location="f0:1819" file="f0" line="1819"/>
  <Field id="_673" name="maxSpectrumWaveDataBuffers" type="_78" offset="608" context="_207" access="public" location="f0:1820" file="f0" line="1820"/>
  <Destructor id="_674" name="FMOD_ADVANCEDSETTINGS" artificial="1" throw="" context="_207" access="public" mangled="_ZN21FMOD_ADVANCEDSETTINGSD1Ev *INTERNAL* " demangled="FMOD_ADVANCEDSETTINGS::~FMOD_ADVANCEDSETTINGS()" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
  </Destructor>
  <OperatorMethod id="_675" name="=" returns="_923" artificial="1" throw="" context="_207" access="public" mangled="_ZN21FMOD_ADVANCEDSETTINGSaSERKS_" demangled="FMOD_ADVANCEDSETTINGS::operator=(FMOD_ADVANCEDSETTINGS const&amp;)" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
    <Argument type="_924" location="f0:1800" file="f0" line="1800"/>
  </OperatorMethod>
  <Constructor id="_676" name="FMOD_ADVANCEDSETTINGS" artificial="1" throw="" context="_207" access="public" mangled="_ZN21FMOD_ADVANCEDSETTINGSC1ERKS_ *INTERNAL* " demangled="FMOD_ADVANCEDSETTINGS::FMOD_ADVANCEDSETTINGS(FMOD_ADVANCEDSETTINGS const&amp;)" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
    <Argument type="_924" location="f0:1800" file="f0" line="1800"/>
  </Constructor>
  <Constructor id="_677" name="FMOD_ADVANCEDSETTINGS" artificial="1" throw="" context="_207" access="public" mangled="_ZN21FMOD_ADVANCEDSETTINGSC1Ev *INTERNAL* " demangled="FMOD_ADVANCEDSETTINGS::FMOD_ADVANCEDSETTINGS()" location="f0:1800" file="f0" line="1800" inline="1"/>
  <PointerType id="_678" type="_789" size="32" align="32"/>
  <PointerType id="_680" type="_506" size="32" align="32"/>
  <PointerType id="_681" type="_107" size="32" align="32"/>
  <PointerType id="_682" type="_116" size="32" align="32"/>
  <PointerType id="_683" type="_576" size="32" align="32"/>
  <PointerType id="_684" type="_893c" size="32" align="32"/>
  <PointerType id="_685" type="_446" size="32" align="32"/>
  <PointerType id="_686" type="_904c" size="32" align="32"/>
  <PointerType id="_688" type="_560" size="32" align="32"/>
  <PointerType id="_689" type="_303" size="32" align="32"/>
  <PointerType id="_690" type="_400" size="32" align="32"/>
  <Field id="_691" name="numsubsounds" type="_359" offset="0" context="_276" access="public" location="f2:146" file="f2" line="146"/>
  <Field id="_692" name="waveformat" type="_927" offset="32" context="_276" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_693" name="plugindata" type="_559" offset="64" context="_276" access="public" location="f2:148" file="f2" line="148"/>
  <Field id="_694" name="filehandle" type="_559" offset="96" context="_276" access="public" location="f2:150" file="f2" line="150"/>
  <Field id="_695" name="filesize" type="_78" offset="128" context="_276" access="public" location="f2:151" file="f2" line="151"/>
  <Field id="_696" name="fileread" type="_127" offset="160" context="_276" access="public" location="f2:152" file="f2" line="152"/>
  <Field id="_697" name="fileseek" type="_113" offset="192" context="_276" access="public" location="f2:153" file="f2" line="153"/>
  <Field id="_698" name="metadata" type="_340" offset="224" context="_276" access="public" location="f2:154" file="f2" line="154"/>
  <Destructor id="_699" name="FMOD_CODEC_STATE" artificial="1" throw="" context="_276" access="public" mangled="_ZN16FMOD_CODEC_STATED1Ev *INTERNAL* " demangled="FMOD_CODEC_STATE::~FMOD_CODEC_STATE()" location="f2:145" file="f2" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_700" name="=" returns="_928" artificial="1" throw="" context="_276" access="public" mangled="_ZN16FMOD_CODEC_STATEaSERKS_" demangled="FMOD_CODEC_STATE::operator=(FMOD_CODEC_STATE const&amp;)" location="f2:145" file="f2" line="145" endline="145" inline="1">
    <Argument type="_929" location="f2:145" file="f2" line="145"/>
  </OperatorMethod>
  <Constructor id="_701" name="FMOD_CODEC_STATE" artificial="1" throw="" context="_276" access="public" mangled="_ZN16FMOD_CODEC_STATEC1ERKS_ *INTERNAL* " demangled="FMOD_CODEC_STATE::FMOD_CODEC_STATE(FMOD_CODEC_STATE const&amp;)" location="f2:145" file="f2" line="145" endline="145" inline="1">
    <Argument type="_929" location="f2:145" file="f2" line="145"/>
  </Constructor>
  <Constructor id="_702" name="FMOD_CODEC_STATE" artificial="1" throw="" context="_276" access="public" mangled="_ZN16FMOD_CODEC_STATEC1Ev *INTERNAL* " demangled="FMOD_CODEC_STATE::FMOD_CODEC_STATE()" location="f2:145" file="f2" line="145" inline="1"/>
  <PointerType id="_703" type="_429" size="32" align="32"/>
  <PointerType id="_704" type="_370" size="32" align="32"/>
  <PointerType id="_707" type="_79" size="32" align="32"/>
  <PointerType id="_711" type="_91" size="32" align="32"/>
  <Function id="_713" name="Debug_SetLevel" returns="_412" context="_357" mangled="_ZN4FMOD14Debug_SetLevelEj" demangled="FMOD::Debug_SetLevel(unsigned int)" location="f4:37" file="f4" line="37" endline="37" inline="1">
    <Argument name="level" type="_89" location="f4:37" file="f4" line="37"/>
  </Function>
  <Function id="_714" name="Memory_Initialize" returns="_412" context="_357" mangled="_ZN4FMOD17Memory_InitializeEPviPFS0_jjEPFS0_S0_jjEPFvS0_jEj" demangled="FMOD::Memory_Initialize(void*, int, void* (*)(unsigned int, unsigned int), void* (*)(void*, unsigned int, unsigned int), void (*)(void*, unsigned int), unsigned int)" location="f4:35" file="f4" line="35" endline="35" inline="1">
    <Argument name="poolmem" type="_559" location="f4:35" file="f4" line="35"/>
    <Argument name="poollen" type="_359" location="f4:35" file="f4" line="35"/>
    <Argument name="useralloc" type="_77" location="f4:35" file="f4" line="35"/>
    <Argument name="userrealloc" type="_179" location="f4:35" file="f4" line="35"/>
    <Argument name="userfree" type="_22" location="f4:35" file="f4" line="35"/>
    <Argument name="memtypeflags" type="_233" location="f4:35" file="f4" line="35" default="-1u"/>
  </Function>
  <Function id="_715" name="File_SetDiskBusy" returns="_412" context="_357" mangled="_ZN4FMOD16File_SetDiskBusyEi" demangled="FMOD::File_SetDiskBusy(int)" location="f4:39" file="f4" line="39" endline="39" inline="1">
    <Argument name="busy" type="_359" location="f4:39" file="f4" line="39"/>
  </Function>
  <Function id="_716" name="System_Create" returns="_412" context="_357" mangled="_ZN4FMOD13System_CreateEPPNS_6SystemE" demangled="FMOD::System_Create(FMOD::System**)" location="f4:45" file="f4" line="45" endline="45" inline="1">
    <Argument name="system" type="_930" location="f4:45" file="f4" line="45"/>
  </Function>
  <Class id="_717" name="Reverb" context="_357" mangled="N4FMOD6ReverbE" demangled="FMOD::Reverb" location="f4:579" file="f4" line="579" artificial="1" size="8" align="8" members="_931 _932 _933 _934 _935 _936 _937 _938 _939 _940 _941 _942 _943 _944 " bases=""/>
  <Class id="_718" name="Geometry" context="_357" mangled="N4FMOD8GeometryE" demangled="FMOD::Geometry" location="f4:536" file="f4" line="536" artificial="1" size="8" align="8" members="_945 _946 _947 _948 _949 _950 _951 _952 _953 _954 _955 _956 _957 _958 _959 _960 _961 _962 _963 _964 _965 _966 _967 _968 _969 " bases=""/>
  <Function id="_719" name="File_GetDiskBusy" returns="_412" context="_357" mangled="_ZN4FMOD16File_GetDiskBusyEPi" demangled="FMOD::File_GetDiskBusy(int*)" location="f4:40" file="f4" line="40" endline="40" inline="1">
    <Argument name="busy" type="_516" location="f4:40" file="f4" line="40"/>
  </Function>
  <Class id="_720" name="Sound" context="_357" mangled="N4FMOD5SoundE" demangled="FMOD::Sound" location="f4:192" file="f4" line="192" artificial="1" size="8" align="8" members="_970 _971 _972 _973 _974 _975 _976 _977 _978 _979 _980 _981 _982 _983 _984 _985 _986 _987 _988 _989 _990 _991 _992 _993 _994 _995 _996 _997 _998 _999 _1000 _1001 _1002 _1003 _1004 _1005 _1006 _1007 _1008 _1009 _1010 _1011 _1012 _1013 _1014 _1015 _1016 _1017 _1018 _1019 _1020 " bases=""/>
  <Class id="_721" name="DSPConnection" context="_357" mangled="N4FMOD13DSPConnectionE" demangled="FMOD::DSPConnection" location="f4:509" file="f4" line="509" artificial="1" size="8" align="8" members="_1021 _1022 _1023 _1024 _1025 _1026 _1027 _1028 _1029 _1030 _1031 _1032 _1033 " bases=""/>
  <Class id="_722" name="ChannelGroup" context="_357" mangled="N4FMOD12ChannelGroupE" demangled="FMOD::ChannelGroup" location="f4:357" file="f4" line="357" artificial="1" size="8" align="8" members="_1034 _1035 _1036 _1037 _1038 _1039 _1040 _1041 _1042 _1043 _1044 _1045 _1046 _1047 _1048 _1049 _1050 _1051 _1052 _1053 _1054 _1055 _1056 _1057 _1058 _1059 _1060 _1061 _1062 _1063 _1064 _1065 _1066 _1067 _1068 _1069 _1070 " bases=""/>
  <Function id="_723" name="Memory_GetStats" returns="_412" context="_357" mangled="_ZN4FMOD15Memory_GetStatsEPiS0_b" demangled="FMOD::Memory_GetStats(int*, int*, bool)" location="f4:36" file="f4" line="36" endline="36" inline="1">
    <Argument name="currentalloced" type="_516" location="f4:36" file="f4" line="36"/>
    <Argument name="maxalloced" type="_516" location="f4:36" file="f4" line="36"/>
    <Argument name="blocking" type="_1071" location="f4:36" file="f4" line="36" default="true"/>
  </Function>
  <Function id="_724" name="Debug_GetLevel" returns="_412" context="_357" mangled="_ZN4FMOD14Debug_GetLevelEPj" demangled="FMOD::Debug_GetLevel(unsigned int*)" location="f4:38" file="f4" line="38" endline="38" inline="1">
    <Argument name="level" type="_744" location="f4:38" file="f4" line="38"/>
  </Function>
  <Class id="_725" name="DSP" context="_357" mangled="N4FMOD3DSPE" demangled="FMOD::DSP" location="f4:454" file="f4" line="454" artificial="1" size="8" align="8" members="_1072 _1073 _1074 _1075 _1076 _1077 _1078 _1079 _1080 _1081 _1082 _1083 _1084 _1085 _1086 _1087 _1088 _1089 _1090 _1091 _1092 _1093 _1094 _1095 _1096 _1097 _1098 _1099 _1100 _1101 _1102 _1103 _1104 " bases=""/>
  <Class id="_726" name="Channel" context="_357" mangled="N4FMOD7ChannelE" demangled="FMOD::Channel" location="f4:264" file="f4" line="264" artificial="1" size="8" align="8" members="_1105 _1106 _1107 _1108 _1109 _1110 _1111 _1112 _1113 _1114 _1115 _1116 _1117 _1118 _1119 _1120 _1121 _1122 _1123 _1124 _1125 _1126 _1127 _1128 _1129 _1130 _1131 _1132 _1133 _1134 _1135 _1136 _1137 _1138 _1139 _1140 _1141 _1142 _1143 _1144 _1145 _1146 _1147 _1148 _1149 _1150 _1151 _1152 _1153 _1154 _1155 _1156 _1157 _1158 _1159 _1160 _1161 _1162 _1163 _1164 _1165 _1166 _1167 _1168 _1169 _1170 _1171 _1172 _1173 _1174 _1175 " bases=""/>
  <Class id="_727" name="SoundGroup" context="_357" mangled="N4FMOD10SoundGroupE" demangled="FMOD::SoundGroup" location="f4:416" file="f4" line="416" artificial="1" size="8" align="8" members="_1176 _1177 _1178 _1179 _1180 _1181 _1182 _1183 _1184 _1185 _1186 _1187 _1188 _1189 _1190 _1191 _1192 _1193 _1194 _1195 _1196 _1197 " bases=""/>
  <Class id="_728" name="System" context="_357" mangled="N4FMOD6SystemE" demangled="FMOD::System" location="f4:52" file="f4" line="52" artificial="1" size="8" align="8" members="_1198 _1199 _1200 _1201 _1202 _1203 _1204 _1205 _1206 _1207 _1208 _1209 _1210 _1211 _1212 _1213 _1214 _1215 _1216 _1217 _1218 _1219 _1220 _1221 _1222 _1223 _1224 _1225 _1226 _1227 _1228 _1229 _1230 _1231 _1232 _1233 _1234 _1235 _1236 _1237 _1238 _1239 _1240 _1241 _1242 _1243 _1244 _1245 _1246 _1247 _1248 _1249 _1250 _1251 _1252 _1253 _1254 _1255 _1256 _1257 _1258 _1259 _1260 _1261 _1262 _1263 _1264 _1265 _1266 _1267 _1268 _1269 _1270 _1271 _1272 _1273 _1274 _1275 _1276 _1277 _1278 _1279 _1280 _1281 _1282 _1283 _1284 _1285 _1286 _1287 _1288 _1289 _1290 _1291 _1292 _1293 _1294 _1295 _1296 _1297 _1298 _1299 " bases=""/>
  <Field id="_729" name="type" type="_287" offset="0" context="_369" access="public" location="f0:1256" file="f0" line="1256"/>
  <Field id="_730" name="datatype" type="_109" offset="32" context="_369" access="public" location="f0:1257" file="f0" line="1257"/>
  <Field id="_731" name="name" type="_509" offset="64" context="_369" access="public" location="f0:1258" file="f0" line="1258"/>
  <Field id="_732" name="data" type="_559" offset="96" context="_369" access="public" location="f0:1259" file="f0" line="1259"/>
  <Field id="_733" name="datalen" type="_78" offset="128" context="_369" access="public" location="f0:1260" file="f0" line="1260"/>
  <Field id="_734" name="updated" type="_360" offset="160" context="_369" access="public" location="f0:1261" file="f0" line="1261"/>
  <Destructor id="_735" name="FMOD_TAG" artificial="1" throw="" context="_369" access="public" mangled="_ZN8FMOD_TAGD1Ev *INTERNAL* " demangled="FMOD_TAG::~FMOD_TAG()" location="f0:1255" file="f0" line="1255" endline="1255" inline="1">
  </Destructor>
  <OperatorMethod id="_736" name="=" returns="_1300" artificial="1" throw="" context="_369" access="public" mangled="_ZN8FMOD_TAGaSERKS_" demangled="FMOD_TAG::operator=(FMOD_TAG const&amp;)" location="f0:1255" file="f0" line="1255" endline="1255" inline="1">
    <Argument type="_1301" location="f0:1255" file="f0" line="1255"/>
  </OperatorMethod>
  <Constructor id="_737" name="FMOD_TAG" artificial="1" throw="" context="_369" access="public" mangled="_ZN8FMOD_TAGC1ERKS_ *INTERNAL* " demangled="FMOD_TAG::FMOD_TAG(FMOD_TAG const&amp;)" location="f0:1255" file="f0" line="1255" endline="1255" inline="1">
    <Argument type="_1301" location="f0:1255" file="f0" line="1255"/>
  </Constructor>
  <Constructor id="_738" name="FMOD_TAG" artificial="1" throw="" context="_369" access="public" mangled="_ZN8FMOD_TAGC1Ev *INTERNAL* " demangled="FMOD_TAG::FMOD_TAG()" location="f0:1255" file="f0" line="1255" inline="1"/>
  <PointerType id="_739" type="_518" size="32" align="32"/>
  <PointerType id="_741" type="_170" size="32" align="32"/>
  <PointerType id="_742" type="_95" size="32" align="32"/>
  <PointerType id="_743" type="_483" size="32" align="32"/>
  <PointerType id="_744" type="_89" size="32" align="32"/>
  <Field id="_745" name="numtracks" type="_359" offset="0" context="_430" access="public" location="f0:1284" file="f0" line="1284"/>
  <Field id="_746" name="min" type="_1302" offset="32" context="_430" access="public" location="f0:1285" file="f0" line="1285"/>
  <Field id="_747" name="sec" type="_1302" offset="3232" context="_430" access="public" location="f0:1286" file="f0" line="1286"/>
  <Field id="_748" name="frame" type="_1302" offset="6432" context="_430" access="public" location="f0:1287" file="f0" line="1287"/>
  <Destructor id="_749" name="FMOD_CDTOC" artificial="1" throw="" context="_430" access="public" mangled="_ZN10FMOD_CDTOCD1Ev *INTERNAL* " demangled="FMOD_CDTOC::~FMOD_CDTOC()" location="f0:1283" file="f0" line="1283" endline="1283" inline="1">
  </Destructor>
  <OperatorMethod id="_750" name="=" returns="_1303" artificial="1" throw="" context="_430" access="public" mangled="_ZN10FMOD_CDTOCaSERKS_" demangled="FMOD_CDTOC::operator=(FMOD_CDTOC const&amp;)" location="f0:1283" file="f0" line="1283" endline="1283" inline="1">
    <Argument type="_1304" location="f0:1283" file="f0" line="1283"/>
  </OperatorMethod>
  <Constructor id="_751" name="FMOD_CDTOC" artificial="1" throw="" context="_430" access="public" mangled="_ZN10FMOD_CDTOCC1ERKS_ *INTERNAL* " demangled="FMOD_CDTOC::FMOD_CDTOC(FMOD_CDTOC const&amp;)" location="f0:1283" file="f0" line="1283" endline="1283" inline="1">
    <Argument type="_1304" location="f0:1283" file="f0" line="1283"/>
  </Constructor>
  <Constructor id="_752" name="FMOD_CDTOC" artificial="1" throw="" context="_430" access="public" mangled="_ZN10FMOD_CDTOCC1Ev *INTERNAL* " demangled="FMOD_CDTOC::FMOD_CDTOC()" location="f0:1283" file="f0" line="1283" inline="1"/>
  <Field id="_753" name="cbsize" type="_359" offset="0" context="_445" access="public" location="f0:1441" file="f0" line="1441"/>
  <Field id="_754" name="length" type="_78" offset="32" context="_445" access="public" location="f0:1442" file="f0" line="1442"/>
  <Field id="_755" name="fileoffset" type="_78" offset="64" context="_445" access="public" location="f0:1443" file="f0" line="1443"/>
  <Field id="_756" name="numchannels" type="_359" offset="96" context="_445" access="public" location="f0:1444" file="f0" line="1444"/>
  <Field id="_757" name="defaultfrequency" type="_359" offset="128" context="_445" access="public" location="f0:1445" file="f0" line="1445"/>
  <Field id="_758" name="format" type="_107" offset="160" context="_445" access="public" location="f0:1446" file="f0" line="1446"/>
  <Field id="_759" name="decodebuffersize" type="_78" offset="192" context="_445" access="public" location="f0:1447" file="f0" line="1447"/>
  <Field id="_760" name="initialsubsound" type="_359" offset="224" context="_445" access="public" location="f0:1448" file="f0" line="1448"/>
  <Field id="_761" name="numsubsounds" type="_359" offset="256" context="_445" access="public" location="f0:1449" file="f0" line="1449"/>
  <Field id="_762" name="inclusionlist" type="_516" offset="288" context="_445" access="public" location="f0:1450" file="f0" line="1450"/>
  <Field id="_763" name="inclusionlistnum" type="_359" offset="320" context="_445" access="public" location="f0:1451" file="f0" line="1451"/>
  <Field id="_764" name="pcmreadcallback" type="_118" offset="352" context="_445" access="public" location="f0:1452" file="f0" line="1452"/>
  <Field id="_765" name="pcmsetposcallback" type="_325" offset="384" context="_445" access="public" location="f0:1453" file="f0" line="1453"/>
  <Field id="_766" name="nonblockcallback" type="_348" offset="416" context="_445" access="public" location="f0:1454" file="f0" line="1454"/>
  <Field id="_767" name="dlsname" type="_684" offset="448" context="_445" access="public" location="f0:1455" file="f0" line="1455"/>
  <Field id="_768" name="encryptionkey" type="_684" offset="480" context="_445" access="public" location="f0:1456" file="f0" line="1456"/>
  <Field id="_769" name="maxpolyphony" type="_359" offset="512" context="_445" access="public" location="f0:1457" file="f0" line="1457"/>
  <Field id="_770" name="userdata" type="_559" offset="544" context="_445" access="public" location="f0:1458" file="f0" line="1458"/>
  <Field id="_771" name="suggestedsoundtype" type="_91" offset="576" context="_445" access="public" location="f0:1459" file="f0" line="1459"/>
  <Field id="_772" name="useropen" type="_45" offset="608" context="_445" access="public" location="f0:1460" file="f0" line="1460"/>
  <Field id="_773" name="userclose" type="_70" offset="640" context="_445" access="public" location="f0:1461" file="f0" line="1461"/>
  <Field id="_774" name="userread" type="_127" offset="672" context="_445" access="public" location="f0:1462" file="f0" line="1462"/>
  <Field id="_775" name="userseek" type="_113" offset="704" context="_445" access="public" location="f0:1463" file="f0" line="1463"/>
  <Field id="_776" name="userasyncread" type="_212" offset="736" context="_445" access="public" location="f0:1464" file="f0" line="1464"/>
  <Field id="_777" name="userasynccancel" type="_465" offset="768" context="_445" access="public" location="f0:1465" file="f0" line="1465"/>
  <Field id="_778" name="speakermap" type="_174" offset="800" context="_445" access="public" location="f0:1466" file="f0" line="1466"/>
  <Field id="_779" name="initialsoundgroup" type="_560" offset="832" context="_445" access="public" location="f0:1467" file="f0" line="1467"/>
  <Field id="_780" name="initialseekposition" type="_78" offset="864" context="_445" access="public" location="f0:1468" file="f0" line="1468"/>
  <Field id="_781" name="initialseekpostype" type="_79" offset="896" context="_445" access="public" location="f0:1469" file="f0" line="1469"/>
  <Field id="_782" name="ignoresetfilesystem" type="_359" offset="928" context="_445" access="public" location="f0:1470" file="f0" line="1470"/>
  <Field id="_783" name="extracodecdata" type="_559" offset="960" context="_445" access="public" location="f0:1471" file="f0" line="1471"/>
  <Destructor id="_784" name="FMOD_CREATESOUNDEXINFO" artificial="1" throw="" context="_445" access="public" mangled="_ZN22FMOD_CREATESOUNDEXINFOD1Ev *INTERNAL* " demangled="FMOD_CREATESOUNDEXINFO::~FMOD_CREATESOUNDEXINFO()" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
  </Destructor>
  <OperatorMethod id="_785" name="=" returns="_1305" artificial="1" throw="" context="_445" access="public" mangled="_ZN22FMOD_CREATESOUNDEXINFOaSERKS_" demangled="FMOD_CREATESOUNDEXINFO::operator=(FMOD_CREATESOUNDEXINFO const&amp;)" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
    <Argument type="_1306" location="f0:1440" file="f0" line="1440"/>
  </OperatorMethod>
  <Constructor id="_786" name="FMOD_CREATESOUNDEXINFO" artificial="1" throw="" context="_445" access="public" mangled="_ZN22FMOD_CREATESOUNDEXINFOC1ERKS_ *INTERNAL* " demangled="FMOD_CREATESOUNDEXINFO::FMOD_CREATESOUNDEXINFO(FMOD_CREATESOUNDEXINFO const&amp;)" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
    <Argument type="_1306" location="f0:1440" file="f0" line="1440"/>
  </Constructor>
  <Constructor id="_787" name="FMOD_CREATESOUNDEXINFO" artificial="1" throw="" context="_445" access="public" mangled="_ZN22FMOD_CREATESOUNDEXINFOC1Ev *INTERNAL* " demangled="FMOD_CREATESOUNDEXINFO::FMOD_CREATESOUNDEXINFO()" location="f0:1440" file="f0" line="1440" inline="1"/>
  <PointerType id="_789" type="_191" size="32" align="32"/>
  <Field id="_793" name="other" type="_78" offset="0" context="_474" access="public" location="f3:38" file="f3" line="38"/>
  <Field id="_794" name="string" type="_78" offset="32" context="_474" access="public" location="f3:39" file="f3" line="39"/>
  <Field id="_795" name="system" type="_78" offset="64" context="_474" access="public" location="f3:40" file="f3" line="40"/>
  <Field id="_796" name="plugins" type="_78" offset="96" context="_474" access="public" location="f3:41" file="f3" line="41"/>
  <Field id="_797" name="output" type="_78" offset="128" context="_474" access="public" location="f3:42" file="f3" line="42"/>
  <Field id="_798" name="channel" type="_78" offset="160" context="_474" access="public" location="f3:43" file="f3" line="43"/>
  <Field id="_799" name="channelgroup" type="_78" offset="192" context="_474" access="public" location="f3:44" file="f3" line="44"/>
  <Field id="_800" name="codec" type="_78" offset="224" context="_474" access="public" location="f3:45" file="f3" line="45"/>
  <Field id="_801" name="file" type="_78" offset="256" context="_474" access="public" location="f3:46" file="f3" line="46"/>
  <Field id="_802" name="sound" type="_78" offset="288" context="_474" access="public" location="f3:47" file="f3" line="47"/>
  <Field id="_803" name="secondaryram" type="_78" offset="320" context="_474" access="public" location="f3:48" file="f3" line="48"/>
  <Field id="_804" name="soundgroup" type="_78" offset="352" context="_474" access="public" location="f3:49" file="f3" line="49"/>
  <Field id="_805" name="streambuffer" type="_78" offset="384" context="_474" access="public" location="f3:50" file="f3" line="50"/>
  <Field id="_806" name="dspconnection" type="_78" offset="416" context="_474" access="public" location="f3:51" file="f3" line="51"/>
  <Field id="_807" name="dsp" type="_78" offset="448" context="_474" access="public" location="f3:52" file="f3" line="52"/>
  <Field id="_808" name="dspcodec" type="_78" offset="480" context="_474" access="public" location="f3:53" file="f3" line="53"/>
  <Field id="_809" name="profile" type="_78" offset="512" context="_474" access="public" location="f3:54" file="f3" line="54"/>
  <Field id="_810" name="recordbuffer" type="_78" offset="544" context="_474" access="public" location="f3:55" file="f3" line="55"/>
  <Field id="_811" name="reverb" type="_78" offset="576" context="_474" access="public" location="f3:56" file="f3" line="56"/>
  <Field id="_812" name="reverbchannelprops" type="_78" offset="608" context="_474" access="public" location="f3:57" file="f3" line="57"/>
  <Field id="_813" name="geometry" type="_78" offset="640" context="_474" access="public" location="f3:58" file="f3" line="58"/>
  <Field id="_814" name="syncpoint" type="_78" offset="672" context="_474" access="public" location="f3:59" file="f3" line="59"/>
  <Field id="_815" name="eventsystem" type="_78" offset="704" context="_474" access="public" location="f3:60" file="f3" line="60"/>
  <Field id="_816" name="musicsystem" type="_78" offset="736" context="_474" access="public" location="f3:61" file="f3" line="61"/>
  <Field id="_817" name="fev" type="_78" offset="768" context="_474" access="public" location="f3:62" file="f3" line="62"/>
  <Field id="_818" name="memoryfsb" type="_78" offset="800" context="_474" access="public" location="f3:63" file="f3" line="63"/>
  <Field id="_819" name="eventproject" type="_78" offset="832" context="_474" access="public" location="f3:64" file="f3" line="64"/>
  <Field id="_820" name="eventgroupi" type="_78" offset="864" context="_474" access="public" location="f3:65" file="f3" line="65"/>
  <Field id="_821" name="soundbankclass" type="_78" offset="896" context="_474" access="public" location="f3:66" file="f3" line="66"/>
  <Field id="_822" name="soundbanklist" type="_78" offset="928" context="_474" access="public" location="f3:67" file="f3" line="67"/>
  <Field id="_823" name="streaminstance" type="_78" offset="960" context="_474" access="public" location="f3:68" file="f3" line="68"/>
  <Field id="_824" name="sounddefclass" type="_78" offset="992" context="_474" access="public" location="f3:69" file="f3" line="69"/>
  <Field id="_825" name="sounddefdefclass" type="_78" offset="1024" context="_474" access="public" location="f3:70" file="f3" line="70"/>
  <Field id="_826" name="sounddefpool" type="_78" offset="1056" context="_474" access="public" location="f3:71" file="f3" line="71"/>
  <Field id="_827" name="reverbdef" type="_78" offset="1088" context="_474" access="public" location="f3:72" file="f3" line="72"/>
  <Field id="_828" name="eventreverb" type="_78" offset="1120" context="_474" access="public" location="f3:73" file="f3" line="73"/>
  <Field id="_829" name="userproperty" type="_78" offset="1152" context="_474" access="public" location="f3:74" file="f3" line="74"/>
  <Field id="_830" name="eventinstance" type="_78" offset="1184" context="_474" access="public" location="f3:75" file="f3" line="75"/>
  <Field id="_831" name="eventinstance_complex" type="_78" offset="1216" context="_474" access="public" location="f3:76" file="f3" line="76"/>
  <Field id="_832" name="eventinstance_simple" type="_78" offset="1248" context="_474" access="public" location="f3:77" file="f3" line="77"/>
  <Field id="_833" name="eventinstance_layer" type="_78" offset="1280" context="_474" access="public" location="f3:78" file="f3" line="78"/>
  <Field id="_834" name="eventinstance_sound" type="_78" offset="1312" context="_474" access="public" location="f3:79" file="f3" line="79"/>
  <Field id="_835" name="eventenvelope" type="_78" offset="1344" context="_474" access="public" location="f3:80" file="f3" line="80"/>
  <Field id="_836" name="eventenvelopedef" type="_78" offset="1376" context="_474" access="public" location="f3:81" file="f3" line="81"/>
  <Field id="_837" name="eventparameter" type="_78" offset="1408" context="_474" access="public" location="f3:82" file="f3" line="82"/>
  <Field id="_838" name="eventcategory" type="_78" offset="1440" context="_474" access="public" location="f3:83" file="f3" line="83"/>
  <Field id="_839" name="eventenvelopepoint" type="_78" offset="1472" context="_474" access="public" location="f3:84" file="f3" line="84"/>
  <Field id="_840" name="eventinstancepool" type="_78" offset="1504" context="_474" access="public" location="f3:85" file="f3" line="85"/>
  <Destructor id="_841" name="FMOD_MEMORY_USAGE_DETAILS" artificial="1" throw="" context="_474" access="public" mangled="_ZN25FMOD_MEMORY_USAGE_DETAILSD1Ev *INTERNAL* " demangled="FMOD_MEMORY_USAGE_DETAILS::~FMOD_MEMORY_USAGE_DETAILS()" location="f3:37" file="f3" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_842" name="=" returns="_1307" artificial="1" throw="" context="_474" access="public" mangled="_ZN25FMOD_MEMORY_USAGE_DETAILSaSERKS_" demangled="FMOD_MEMORY_USAGE_DETAILS::operator=(FMOD_MEMORY_USAGE_DETAILS const&amp;)" location="f3:37" file="f3" line="37" endline="37" inline="1">
    <Argument type="_1308" location="f3:37" file="f3" line="37"/>
  </OperatorMethod>
  <Constructor id="_843" name="FMOD_MEMORY_USAGE_DETAILS" artificial="1" throw="" context="_474" access="public" mangled="_ZN25FMOD_MEMORY_USAGE_DETAILSC1ERKS_ *INTERNAL* " demangled="FMOD_MEMORY_USAGE_DETAILS::FMOD_MEMORY_USAGE_DETAILS(FMOD_MEMORY_USAGE_DETAILS const&amp;)" location="f3:37" file="f3" line="37" endline="37" inline="1">
    <Argument type="_1308" location="f3:37" file="f3" line="37"/>
  </Constructor>
  <Constructor id="_844" name="FMOD_MEMORY_USAGE_DETAILS" artificial="1" throw="" context="_474" access="public" mangled="_ZN25FMOD_MEMORY_USAGE_DETAILSC1Ev *INTERNAL* " demangled="FMOD_MEMORY_USAGE_DETAILS::FMOD_MEMORY_USAGE_DETAILS()" location="f3:37" file="f3" line="37" inline="1"/>
  <Field id="_845" name="name" type="_684" offset="0" context="_482" access="public" location="f2:49" file="f2" line="49"/>
  <Field id="_846" name="version" type="_78" offset="32" context="_482" access="public" location="f2:50" file="f2" line="50"/>
  <Field id="_847" name="defaultasstream" type="_359" offset="64" context="_482" access="public" location="f2:51" file="f2" line="51"/>
  <Field id="_848" name="timeunits" type="_79" offset="96" context="_482" access="public" location="f2:52" file="f2" line="52"/>
  <Field id="_849" name="open" type="_449" offset="128" context="_482" access="public" location="f2:53" file="f2" line="53"/>
  <Field id="_850" name="close" type="_259" offset="160" context="_482" access="public" location="f2:54" file="f2" line="54"/>
  <Field id="_851" name="read" type="_499" offset="192" context="_482" access="public" location="f2:55" file="f2" line="55"/>
  <Field id="_852" name="getlength" type="_473" offset="224" context="_482" access="public" location="f2:56" file="f2" line="56"/>
  <Field id="_853" name="setposition" type="_292" offset="256" context="_482" access="public" location="f2:57" file="f2" line="57"/>
  <Field id="_854" name="getposition" type="_494" offset="288" context="_482" access="public" location="f2:58" file="f2" line="58"/>
  <Field id="_855" name="soundcreate" type="_404" offset="320" context="_482" access="public" location="f2:59" file="f2" line="59"/>
  <Field id="_856" name="getwaveformat" type="_308" offset="352" context="_482" access="public" location="f2:60" file="f2" line="60"/>
  <Destructor id="_857" name="FMOD_CODEC_DESCRIPTION" artificial="1" throw="" context="_482" access="public" mangled="_ZN22FMOD_CODEC_DESCRIPTIOND1Ev *INTERNAL* " demangled="FMOD_CODEC_DESCRIPTION::~FMOD_CODEC_DESCRIPTION()" location="f2:48" file="f2" line="48" endline="48" inline="1">
  </Destructor>
  <OperatorMethod id="_858" name="=" returns="_1309" artificial="1" throw="" context="_482" access="public" mangled="_ZN22FMOD_CODEC_DESCRIPTIONaSERKS_" demangled="FMOD_CODEC_DESCRIPTION::operator=(FMOD_CODEC_DESCRIPTION const&amp;)" location="f2:48" file="f2" line="48" endline="48" inline="1">
    <Argument type="_1310" location="f2:48" file="f2" line="48"/>
  </OperatorMethod>
  <Constructor id="_859" name="FMOD_CODEC_DESCRIPTION" artificial="1" throw="" context="_482" access="public" mangled="_ZN22FMOD_CODEC_DESCRIPTIONC1ERKS_ *INTERNAL* " demangled="FMOD_CODEC_DESCRIPTION::FMOD_CODEC_DESCRIPTION(FMOD_CODEC_DESCRIPTION const&amp;)" location="f2:48" file="f2" line="48" endline="48" inline="1">
    <Argument type="_1310" location="f2:48" file="f2" line="48"/>
  </Constructor>
  <Constructor id="_860" name="FMOD_CODEC_DESCRIPTION" artificial="1" throw="" context="_482" access="public" mangled="_ZN22FMOD_CODEC_DESCRIPTIONC1Ev *INTERNAL* " demangled="FMOD_CODEC_DESCRIPTION::FMOD_CODEC_DESCRIPTION()" location="f2:48" file="f2" line="48" inline="1"/>
  <Field id="_861" name="Instance" type="_359" offset="0" context="_485" access="public" location="f0:1518" file="f0" line="1518"/>
  <Field id="_862" name="Environment" type="_359" offset="32" context="_485" access="public" location="f0:1519" file="f0" line="1519"/>
  <Field id="_863" name="EnvSize" type="_558" offset="64" context="_485" access="public" location="f0:1520" file="f0" line="1520"/>
  <Field id="_864" name="EnvDiffusion" type="_558" offset="96" context="_485" access="public" location="f0:1521" file="f0" line="1521"/>
  <Field id="_865" name="Room" type="_359" offset="128" context="_485" access="public" location="f0:1522" file="f0" line="1522"/>
  <Field id="_866" name="RoomHF" type="_359" offset="160" context="_485" access="public" location="f0:1523" file="f0" line="1523"/>
  <Field id="_867" name="RoomLF" type="_359" offset="192" context="_485" access="public" location="f0:1524" file="f0" line="1524"/>
  <Field id="_868" name="DecayTime" type="_558" offset="224" context="_485" access="public" location="f0:1525" file="f0" line="1525"/>
  <Field id="_869" name="DecayHFRatio" type="_558" offset="256" context="_485" access="public" location="f0:1526" file="f0" line="1526"/>
  <Field id="_870" name="DecayLFRatio" type="_558" offset="288" context="_485" access="public" location="f0:1527" file="f0" line="1527"/>
  <Field id="_871" name="Reflections" type="_359" offset="320" context="_485" access="public" location="f0:1528" file="f0" line="1528"/>
  <Field id="_872" name="ReflectionsDelay" type="_558" offset="352" context="_485" access="public" location="f0:1529" file="f0" line="1529"/>
  <Field id="_873" name="ReflectionsPan" type="_1311" offset="384" context="_485" access="public" location="f0:1530" file="f0" line="1530"/>
  <Field id="_874" name="Reverb" type="_359" offset="480" context="_485" access="public" location="f0:1531" file="f0" line="1531"/>
  <Field id="_875" name="ReverbDelay" type="_558" offset="512" context="_485" access="public" location="f0:1532" file="f0" line="1532"/>
  <Field id="_876" name="ReverbPan" type="_1311" offset="544" context="_485" access="public" location="f0:1533" file="f0" line="1533"/>
  <Field id="_877" name="EchoTime" type="_558" offset="640" context="_485" access="public" location="f0:1534" file="f0" line="1534"/>
  <Field id="_878" name="EchoDepth" type="_558" offset="672" context="_485" access="public" location="f0:1535" file="f0" line="1535"/>
  <Field id="_879" name="ModulationTime" type="_558" offset="704" context="_485" access="public" location="f0:1536" file="f0" line="1536"/>
  <Field id="_880" name="ModulationDepth" type="_558" offset="736" context="_485" access="public" location="f0:1537" file="f0" line="1537"/>
  <Field id="_881" name="AirAbsorptionHF" type="_558" offset="768" context="_485" access="public" location="f0:1538" file="f0" line="1538"/>
  <Field id="_882" name="HFReference" type="_558" offset="800" context="_485" access="public" location="f0:1539" file="f0" line="1539"/>
  <Field id="_883" name="LFReference" type="_558" offset="832" context="_485" access="public" location="f0:1540" file="f0" line="1540"/>
  <Field id="_884" name="RoomRolloffFactor" type="_558" offset="864" context="_485" access="public" location="f0:1541" file="f0" line="1541"/>
  <Field id="_885" name="Diffusion" type="_558" offset="896" context="_485" access="public" location="f0:1542" file="f0" line="1542"/>
  <Field id="_886" name="Density" type="_558" offset="928" context="_485" access="public" location="f0:1543" file="f0" line="1543"/>
  <Field id="_887" name="Flags" type="_78" offset="960" context="_485" access="public" location="f0:1544" file="f0" line="1544"/>
  <Destructor id="_888" name="FMOD_REVERB_PROPERTIES" artificial="1" throw="" context="_485" access="public" mangled="_ZN22FMOD_REVERB_PROPERTIESD1Ev *INTERNAL* " demangled="FMOD_REVERB_PROPERTIES::~FMOD_REVERB_PROPERTIES()" location="f0:1517" file="f0" line="1517" endline="1517" inline="1">
  </Destructor>
  <OperatorMethod id="_889" name="=" returns="_1312" artificial="1" throw="" context="_485" access="public" mangled="_ZN22FMOD_REVERB_PROPERTIESaSERKS_" demangled="FMOD_REVERB_PROPERTIES::operator=(FMOD_REVERB_PROPERTIES const&amp;)" location="f0:1517" file="f0" line="1517" endline="1517" inline="1">
    <Argument type="_1313" location="f0:1517" file="f0" line="1517"/>
  </OperatorMethod>
  <Constructor id="_890" name="FMOD_REVERB_PROPERTIES" artificial="1" throw="" context="_485" access="public" mangled="_ZN22FMOD_REVERB_PROPERTIESC1ERKS_ *INTERNAL* " demangled="FMOD_REVERB_PROPERTIES::FMOD_REVERB_PROPERTIES(FMOD_REVERB_PROPERTIES const&amp;)" location="f0:1517" file="f0" line="1517" endline="1517" inline="1">
    <Argument type="_1313" location="f0:1517" file="f0" line="1517"/>
  </Constructor>
  <Constructor id="_891" name="FMOD_REVERB_PROPERTIES" artificial="1" throw="" context="_485" access="public" mangled="_ZN22FMOD_REVERB_PROPERTIESC1Ev *INTERNAL* " demangled="FMOD_REVERB_PROPERTIES::FMOD_REVERB_PROPERTIES()" location="f0:1517" file="f0" line="1517" inline="1"/>
  <FundamentalType id="_895" name="short unsigned int" size="16" align="16"/>
  <ArrayType id="_896" min="0" max="7u" type="_1314" size="64" align="8"/>
  <ReferenceType id="_897" type="_38" size="32" align="32"/>
  <ReferenceType id="_898" type="_38c" size="32" align="32"/>
  <ArrayType id="_899" min="0" max="31u" type="_893" size="256" align="8"/>
  <PointerType id="_900" type="_149" size="32" align="32"/>
  <ReferenceType id="_901" type="_47" size="32" align="32"/>
  <ReferenceType id="_902" type="_47c" size="32" align="32"/>
  <ReferenceType id="_905" type="_96" size="32" align="32"/>
  <ReferenceType id="_906" type="_96c" size="32" align="32"/>
  <ArrayType id="_907" min="0" max="255u" type="_893" size="2048" align="8"/>
  <ReferenceType id="_908" type="_131" size="32" align="32"/>
  <ReferenceType id="_909" type="_131c" size="32" align="32"/>
  <ArrayType id="_911" min="0" max="15u" type="_893" size="128" align="8"/>
  <ReferenceType id="_912" type="_148" size="32" align="32"/>
  <ReferenceType id="_913" type="_148c" size="32" align="32"/>
  <ReferenceType id="_914" type="_154" size="32" align="32"/>
  <ReferenceType id="_915" type="_154c" size="32" align="32"/>
  <ReferenceType id="_916" type="_169" size="32" align="32"/>
  <ReferenceType id="_917" type="_169c" size="32" align="32"/>
  <ReferenceType id="_919" type="_204" size="32" align="32"/>
  <ReferenceType id="_920" type="_204c" size="32" align="32"/>
  <PointerType id="_921" type="_509" size="32" align="32"/>
  <PointerType id="_922" type="_122" size="32" align="32"/>
  <ReferenceType id="_923" type="_207" size="32" align="32"/>
  <ReferenceType id="_924" type="_207c" size="32" align="32"/>
  <PointerType id="_927" type="_132" size="32" align="32"/>
  <ReferenceType id="_928" type="_276" size="32" align="32"/>
  <ReferenceType id="_929" type="_276c" size="32" align="32"/>
  <PointerType id="_930" type="_1324" size="32" align="32"/>
  <Destructor id="_931" name="Reverb" artificial="1" throw="" context="_717" access="public" mangled="_ZN4FMOD6ReverbD1Ev *INTERNAL* " demangled="FMOD::Reverb::~Reverb()" location="f4:579" file="f4" line="579" endline="579" inline="1">
  </Destructor>
